---
kind: property
id: P:Autodesk.Revit.DB.Electrical.InsulationTypeSet.Size
source: html/7dc65ef4-50ec-c816-118e-e20179850e56.htm
---
# Autodesk.Revit.DB.Electrical.InsulationTypeSet.Size Property

Returns the number of insulation types that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```